app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Friends"], ["created_at", "2021-11-07 18:38:27.295551"], ["updated_at", "2021-11-07 18:38:27.295551"]]
---
  def create
    @room = Room.create(name: params["room"]["name"])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @message = Message.new
    @current_user = current_user
    @single_room = Room.find(params[:id])