app/models/room.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2021-11-09 13:27:09.970330"], ["updated_at", "2021-11-09 13:27:09.970330"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["room_id", 9], ["created_at", "2021-11-09 13:27:10.036536"], ["updated_at", "2021-11-09 13:27:10.036536"]]
---
  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)